app/Models/newsModel.php

SELECT *
FROM `news`
---
    public function getNews($slug = false)
    {
        if ($slug === false) {
            return $this->findAll();